In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("database.sqlite3")
connection.row_factory = sqlite3.Row
cursor = connection.cursor()

In [3]:
# listing all tables
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[<sqlite3.Row object at 0x1065b8a60>]

In [4]:
# information on the table users
df = pd.read_sql_query("PRAGMA table_info(users)", connection)
df

   cid      name          type  notnull dflt_value  pk
0    0        id       INTEGER        1       None   1
1    1  username   VARCHAR(50)        1       None   0
2    2  password  VARCHAR(100)        1       None   0

In [5]:
# user data
df = pd.read_sql_query("SELECT * FROM users", connection)
df

   id username    password
0   1    admin  dubai2020!
1   2   patson   patson123

In [6]:
username = "admin"
password = "dubai2020!"

query = f"SELECT * FROM users WHERE username = '{username}' AND password = '{password}'"

cursor.execute(query)

user = cursor.fetchone()

In [7]:
user
user['username']
user['password']

'dubai2020!'

In [8]:
query = "SELECT * FROM users"
users = cursor.execute(query).fetchall()

In [9]:
for row in users:
    print(f"User {row['username']}")

User admin
User patson

In [10]:
username = "admin"
password = "admin123"

query = f"""SELECT * FROM users WHERE username = '{username}' AND password = '{password}';"""

cursor.executescript(query)

user = cursor.fetchall()

In [11]:
connection.close()